Skylark/app/views/customer_order/display_order.html.erb

SELECT  `customerOrder`.* FROM `customerOrder` ORDER BY `customerOrder`.`id` DESC LIMIT 1
---

    <% order = CustomerOrder.last  %>