Skylark/app/controllers/basket_controller.rb

  def complete

    if cookies.has_key?(:cart)
    product_array = JSON.parse(cookies[:cart])
    order_array =
    product_array.each do | item |

      product = Packageholiday.find(item['id'].to_i)
      cost = product.Cost
      order = CustomerOrder.new(:id => nil, :customer_id => '666'.to_i, :customerItem => item['id'].to_i, :orderStatus => '2'.to_i, :totalCost => cost.to_i).save
---
INSERT INTO `customerOrder` (`id`, `cookieID`, `customerItem`, `orderStatus`, `totalCost`) VALUES (0, 666, 1, 2, 1000)