Skylark/app/controllers/city_controller.rb

SELECT `cities`.* FROM `cities`
---
  def displayall
    @city = City.all