Skylark/app/controllers/flight_controller.rb

SELECT `flights`.* FROM `flights`
---
  def displayall

    @flight = Flight.all