Skylark/app/controllers/hotel_controller.rb

SELECT  `hotels`.* FROM `hotels` WHERE `hotels`.`Hotel_ID` = 1 LIMIT 1
SELECT `countries`.* FROM `countries`
---
  def displayall
  @hotel = Hotel.all
  @country = Country.all