Skylark/app/controllers/index_controller.rb

SELECT `countries`.* FROM `countries`
---
  def index

    @country = Country.all